erp3l/src/Catalogs/РегистрыБухгалтерииБД/РегистрыБухгалтерииБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РегистрыБухгалтерииБД</name>
  <comment>Содержит данные, необходимые для параметрической настройки выборки данных из регистров бухгалтерии текущей и внешних информационных баз</comment>
  <owners>Catalog.ТипыБазДанных</owners>
  <attributes>
    <name>Корреспонденция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Регистраторы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Измерения</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Балансовый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакУчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НеЯвляетсяРазделителемДанных</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ресурсы</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Балансовый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакУчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакУчетаСубконто</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/РегистрыБухгалтерииБД/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ОбновитьПоДаннымВИБСервер()
	
	ТекОбъект=РеквизитФормыВЗначение("Объект");
	ТекОбъект.ЗаполнитьРеквизитыОбъекта();
    ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	
	Модифицированность=Истина;
		
КонецПроцедуры // ОбновитьПоДанныммВИБ() 

&НаКлиенте
Процедура ОбновитьПоДаннымВИБ(Команда)
	
	ОбновитьПоДаннымВИБСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмеренияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя="ИзмеренияТипДанных" Тогда
		
		ДанныеОбъекта=Новый Структура;
		ДанныеОбъекта.Вставить("ИмяОбъекта",СтрШаблон(Нстр("ru = 'регистр бухгалтерии %1'"), Объект.Синоним));
		ДанныеОбъекта.Вставить("ТекстПоля",СтрШаблон(Нстр("ru = ' измерение %1'"), Элементы.Измерения.ТекущиеДанные.Имя));
		ДанныеОбъекта.Вставить("ТипДанных",Элементы.Измерения.ТекущиеДанные.ТипДанных);	
		
		ОткрытьФорму("ОбщаяФорма.ФормаПросмотраТипаЗначений",ДанныеОбъекта);		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя="РеквизитыТипДанных" Тогда
		
		ДанныеОбъекта=Новый Структура;
		ДанныеОбъекта.Вставить("ИмяОбъекта",СтрШаблон(Нстр("ru = 'регистр бухгалтерии %1'"), Объект.Синоним));
		ДанныеОбъекта.Вставить("ТекстПоля",СтрШаблон(Нстр("ru = ' реквизит %1'"), Элементы.Реквизиты.ТекущиеДанные.Имя));
		ДанныеОбъекта.Вставить("ТипДанных",Элементы.Реквизиты.ТекущиеДанные.ТипДанных);	
		
		ОткрытьФорму("ОбщаяФорма.ФормаПросмотраТипаЗначений",ДанныеОбъекта);		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РегистраторыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	ДанныеОбъекта=Новый Структура;	
	ДанныеОбъекта.Вставить("ИмяОбъекта",СтрШаблон(Нстр("ru = 'регистр бухгалтерии %1'"), Объект.Синоним));
	ДанныеОбъекта.Вставить("ТекстПоля",Нстр("ru = ' регистраторы'"));
	ДанныеОбъекта.Вставить("ТипДанных",Объект.Регистраторы);	
	
	ОткрытьФорму("ОбщаяФорма.ФормаПросмотраТипаЗначений",ДанныеОбъекта);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Видимость надписи Отсутствует в конфигурации.
	Элементы.ОтсутствуетВКонфигурацииНадпись.Видимость = Объект.ОтсутствуетВКонфигурации;
КонецПроцедуры
